print("{} 평균 : {:.2f}".format("홍길동",(100+100+99)/3))
name = "홍길동"

#### f함수 소수점자리 출력
a = 1.12345
print(f"소수점 2자리 출력 : {a:.2f}")









print("출력이 됩니다.!!")

print("""\
1.최근 한 온라인 커뮤니티에는 30대 가해자 A씨의 이름과 사진, 
SNS 계정 등 신상정보가 확산하고 있다. 
시민들은 SNS 계정을 찾아가 비난 댓글을 남기거나 
경찰을 향해 신상 공개를 요구했다.  
누리꾼들은 그가 운영 중인 식당 정보를 퍼 나르며 
'불매'를 주도하고 있다.      
""")



# name = "홍길동"
# num = 100
# num2 = 100
# num3 = 99
# print("%s 합계 : %d" % (name,num+num2+num3))
# print("{} 합계 : {}".format(name,num+num2+num3))
# print("%s 평균 : %.2f" % (name,(num+num2+num3)/3))
# print("{} 평균 : {:.2f}".format(name,(num+num2+num3)/3))

# # 숫자 : 12.12345 , 456.78940, 2.252525
# # 소수점 2자리 출력
# # 숫자 : 12.12, 456.79, 2.25
# print("숫자 : {:.2f},{:.2f},{:.2f}".format(12.12345 , 456.78940, 2.252525))

# print("\*")
# print("안녕\n하세요.")
# print("안녕\t하세요.")
# print("안녕하세요.")

# print("최근 한 온라인 커뮤니티에는 30대 가해자 A씨의 이름과 사진,\n SNS 계정 등 신상정보가 확산하고 있다. 시민들은 SNS 계정을 찾아가 비난 댓글을 남기거나 경찰을 향해 신상 공개를 요구했다. 누리꾼들은 그가 운영 중인 식당 정보를 퍼 나르며 '불매'를 주도하고 있다.")


# print("""\
# 1.최근 한 온라인 커뮤니티에는 30대 가해자 A씨의 이름과 사진, 
# SNS 계정 등 신상정보가 확산하고 있다. 
# 시민들은 SNS 계정을 찾아가 비난 댓글을 남기거나 
# 경찰을 향해 신상 공개를 요구했다.  
# 누리꾼들은 그가 운영 중인 식당 정보를 퍼 나르며 
# '불매'를 주도하고 있다.      
# """)